app/controllers/api/v1/casts_controller.rb

SELECT "casts".* FROM "casts"
---
  def index
      @casts = Cast.all

INSERT INTO "casts" ("actor_id", "production_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["actor_id", 3], ["production_id", 27], ["created_at", "2018-09-19 18:17:02.042242"], ["updated_at", "2018-09-19 18:17:02.042242"]]
---
  def create
    cast = Cast.new(cast_params)
    if cast.save