app/controllers/api/v1/productions_controller.rb

    def index
        @productions = Production.all
---
SELECT "productions".* FROM "productions"

    def create
        production = Production.new(production_params)
        if production.save
---
INSERT INTO "productions" ("user_id", "script_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["script_id", 16], ["created_at", "2018-06-19 21:30:15.604247"], ["updated_at", "2018-06-19 21:30:15.604247"]]

        def find_production
            @production = Production.find(params[:id])
---
SELECT  "productions".* FROM "productions" WHERE "productions"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]