app/controllers/api/v1/scripts_controller.rb

    def index
        @scripts = Script.all
---
SELECT "scripts".* FROM "scripts"

    def create
        script = Script.new(script_params)
        if script.save
---
INSERT INTO "scripts" ("title", "user_id", "line_1", "line_2", "line_3", "line_4", "line_5", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

        def get_script
            @script = Script.find(params[:id])
---
SELECT  "scripts".* FROM "scripts" WHERE "scripts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]